cases/dns_channel/system/yplus_6
(0.0122718 0.0145984 0.00818123)
(0.0368155 0.0145984 0.00818123)
(0.0613592 0.0145984 0.00818123)
(0.0859029 0.0145984 0.00818123)
(0.110447 0.0145984 0.00818123)
(0.13499 0.0145984 0.00818123)
(0.159534 0.0145984 0.00818123)
(0.184078 0.0145984 0.00818123)
(0.208621 0.0145984 0.00818123)
(0.233165 0.0145984 0.00818123)
(0.257709 0.0145984 0.00818123)
(0.282252 0.0145984 0.00818123)
(0.306796 0.0145984 0.00818123)
(0.33134 0.0145984 0.00818123)
(0.355884 0.0145984 0.00818123)
(0.380427 0.0145984 0.00818123)
(0.404971 0.0145984 0.00818123)
(0.429515 0.0145984 0.00818123)
(0.454058 0.0145984 0.00818123)
(0.478602 0.0145984 0.00818123)
(0.503146 0.0145984 0.00818123)
(0.527689 0.0145984 0.00818123)
(0.552233 0.0145984 0.00818123)
(0.576777 0.0145984 0.00818123)
(0.60132 0.0145984 0.00818123)
(0.625864 0.0145984 0.00818123)
(0.650408 0.0145984 0.00818123)
(0.674952 0.0145984 0.00818123)
(0.699495 0.0145984 0.00818123)
(0.724039 0.0145984 0.00818123)
(0.748583 0.0145984 0.00818123)
(0.773126 0.0145984 0.00818123)
(0.79767 0.0145984 0.00818123)
(0.822214 0.0145984 0.00818123)
(0.846757 0.0145984 0.00818123)
(0.871301 0.0145984 0.00818123)
(0.895845 0.0145984 0.00818123)
(0.920388 0.0145984 0.00818123)
(0.944932 0.0145984 0.00818123)
(0.969476 0.0145984 0.00818123)
(0.99402 0.0145984 0.00818123)
(1.01856 0.0145984 0.00818123)
(1.04311 0.0145984 0.00818123)
(1.06765 0.0145984 0.00818123)
(1.09219 0.0145984 0.00818123)
(1.11674 0.0145984 0.00818123)
(1.14128 0.0145984 0.00818123)
(1.16583 0.0145984 0.00818123)
(1.19037 0.0145984 0.00818123)
(1.21491 0.0145984 0.00818123)
(1.23946 0.0145984 0.00818123)
(1.264 0.0145984 0.00818123)
(1.28854 0.0145984 0.00818123)
(1.31309 0.0145984 0.00818123)
(1.33763 0.0145984 0.00818123)
(1.36217 0.0145984 0.00818123)
(1.38672 0.0145984 0.00818123)
(1.41126 0.0145984 0.00818123)
(1.43581 0.0145984 0.00818123)
(1.46035 0.0145984 0.00818123)
(1.48489 0.0145984 0.00818123)
(1.50944 0.0145984 0.00818123)
(1.53398 0.0145984 0.00818123)
(1.55852 0.0145984 0.00818123)
(1.58307 0.0145984 0.00818123)
(1.60761 0.0145984 0.00818123)
(1.63216 0.0145984 0.00818123)
(1.6567 0.0145984 0.00818123)
(1.68124 0.0145984 0.00818123)
(1.70579 0.0145984 0.00818123)
(1.73033 0.0145984 0.00818123)
(1.75487 0.0145984 0.00818123)
(1.77942 0.0145984 0.00818123)
(1.80396 0.0145984 0.00818123)
(1.82851 0.0145984 0.00818123)
(1.85305 0.0145984 0.00818123)
(1.87759 0.0145984 0.00818123)
(1.90214 0.0145984 0.00818123)
(1.92668 0.0145984 0.00818123)
(1.95122 0.0145984 0.00818123)
(1.97577 0.0145984 0.00818123)
(2.00031 0.0145984 0.00818123)
(2.02485 0.0145984 0.00818123)
(2.0494 0.0145984 0.00818123)
(2.07394 0.0145984 0.00818123)
(2.09849 0.0145984 0.00818123)
(2.12303 0.0145984 0.00818123)
(2.14757 0.0145984 0.00818123)
(2.17212 0.0145984 0.00818123)
(2.19666 0.0145984 0.00818123)
(2.2212 0.0145984 0.00818123)
(2.24575 0.0145984 0.00818123)
(2.27029 0.0145984 0.00818123)
(2.29484 0.0145984 0.00818123)
(2.31938 0.0145984 0.00818123)
(2.34392 0.0145984 0.00818123)
(2.36847 0.0145984 0.00818123)
(2.39301 0.0145984 0.00818123)
(2.41755 0.0145984 0.00818123)
(2.4421 0.0145984 0.00818123)
...
(6.27091 0.0145984 3.13341)
